# 3. Написать функцию, аргументы имена сотрудников, 
# возвращает словарь, ключи — первые буквы имён, 
# значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"

# out

# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

def emp_names(*args):
    names_d = {}
    for i in sorted(args):
        title = i[0]
        if title not in names_d:
            names_d[title] = [i]
        else:
            names_d[title] += [i]


    return names_d


print(emp_names("Иван", "Мария", "Петр", "Илья", "Марина", "Алина", "Бибочка"))